biddr_api/app/controllers/api/v1/auctions_controller.rb

INSERT INTO "auctions" ("title", "details", "end_date", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        auction = Auction.new auction_params
        auction.user = current_user

        auction.save!

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
    def index
        auctions = Auction.order created_at: :desc