biddr_api/app/controllers/api/v1/bids_controller.rb

    def create
        bid = Bid.new bid_params
        bid.auction = auction
        bid.user = current_user
        bid.save!
---
INSERT INTO "bids" ("bid_price", "user_id", "auction_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["bid_price", 89], ["user_id", 112], ["auction_id", 180], ["created_at", "2018-11-26 21:38:31.400048"], ["updated_at", "2018-11-26 21:38:31.400048"]]